# 1.

In [1]:
### 이곳에서 제출폼 과제를 진행해 주세요 ###
import pandas as pd
df = pd.read_csv("https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/assignments/purchase_data.csv", sep=",",index_col=0)

df.head()

,SN,Age,Gender,Item ID,Item Name,Price
Purchase ID,,,,,,
0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,Ithergue48,24,Male,92,Final Critic,4.88
3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,Iskosia90,23,Male,131,Fury,1.44

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 780 entries, 0 to 779
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   SN         780 non-null    object
 1   Age        780 non-null    int64
 2   Gender     780 non-null    object
 3   Item ID    780 non-null    int64
 4   Item Name  780 non-null    object
 5   Price      780 non-null    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 42.7+ KB

In [3]:
df_20 = df[df.Age == 20].groupby('Gender').Price.sum()
df_20

Gender
Female                    43.73
Male                     260.20
Other / Non-Disclosed     10.39
Name: Price, dtype: float64

In [4]:
## 다음 result 함수 안에 male, female 변수를 계산하세요.(groupby, get_group을 사용하세요.)
## sum_male: Age = 20, Gender = "Male" 그룹의 Price를 합하세요.
## sum_female: Age = 20, Gender = "Female" 그룹의 Price를 합하세요.

def result(df):
    

    sum_male = df[df.Age == 20].groupby('Gender').get_group('Male').Price.sum()
    sum_female = df[df.Age == 20].groupby('Gender').get_group('Female').Price.sum()

    print("sum_male: {}, \nsum_female: {}".format(sum_male, sum_female))
    return round(sum_male + sum_female)

result(df)

sum_male: 260.2,
sum_female: 43.730000000000004

304

In [5]:
### 이곳에서 본인 데이터로 과제를 진행해 주세요 ###

# 2.

In [6]:
len(df['Item ID'].unique())

183

In [7]:
len(df['SN'].unique())

576

In [8]:
df['Item ID'].value_counts()

178    12
82      9
108     9
145     9
92      8
       ..
42      1
118     1
104     1
27      1
51      1
Name: Item ID, Length: 183, dtype: int64

In [9]:
### 이곳에서 제출폼 과제를 진행해 주세요 ###
# 그룹별 Price 평균

bins = [1, 21, 51]
bins_label = ['1~20', '21~50']

df['Group'] = pd.cut(df['Age'], bins, right=False, labels = bins_label)

df.groupby('Group').Price.mean()

Group
1~20     3.101818
21~50    3.021559
Name: Price, dtype: float64

In [10]:
# 판매수 상위 Item ID

df2 = df.reset_index()

df3 = df2.groupby('Item ID').agg(**{
    'Sell' : pd.NamedAgg(column = 'Purchase ID', aggfunc = 'count'),
    'Price' :  pd.NamedAgg(column = 'Price', aggfunc = 'mean'),
    
})
df3['T_Sales'] = df3['Sell'] * df3['Price']

df3.sort_values(by = 'T_Sales', ascending = False)

         Sell  Price  T_Sales
Item ID
178        12   4.23    50.76
82          9   4.90    44.10
145         9   4.58    41.22
92          8   4.88    39.04
103         8   4.35    34.80
...       ...    ...      ...
125         2   1.00     2.00
126         1   2.00     2.00
23          1   1.99     1.99
104         1   1.93     1.93
42          1   1.75     1.75

[183 rows x 3 columns]

In [11]:
# 매출 상위 Item IDs

df3.sort_values(by = 'Sell', ascending = False)

         Sell  Price  T_Sales
Item ID
178        12   4.23    50.76
145         9   4.58    41.22
108         9   3.53    31.77
82          9   4.90    44.10
19          8   1.02     8.16
...       ...    ...      ...
104         1   1.93     1.93
23          1   1.99     1.99
180         1   3.36     3.36
91          1   4.17     4.17
134         1   4.50     4.50

[183 rows x 3 columns]

In [14]:
# 1,2,3,4 다 맞음

In [12]:
### 이곳에서 본인 데이터로 과제를 진행해 주세요 ###